In [8]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
from pandas import read_html

In [6]:
df = pd.read_csv('mycsv.csv', header=None)
df

   0      1   2        3
0  1  Meera  25  teacher
1  2    Sam  32   dancer
2  3   Nola  28   doctor
3  4  Peter  22   artist

In [7]:
df1 = pd.read_table('mycsv.csv', sep=",",header=None) #can read files using read_table and indicate the delimiter
df1

   0      1   2        3
0  1  Meera  25  teacher
1  2    Sam  32   dancer
2  3   Nola  28   doctor
3  4  Peter  22   artist

In [8]:
df1.to_csv('mynewout.csv')

In [9]:
import sys

In [10]:
df1.to_csv(sys.stdout)

,0,1,2,3
0,1,Meera,25,teacher
1,2,Sam,32,dancer
2,3,Nola,28,doctor
3,4,Peter,22,artist

In [13]:
df1.to_csv(sys.stdout,columns=[0,1])

,0,1
0,1,Meera
1,2,Sam
2,3,Nola
3,4,Peter

In [ ]:
df1.to_csv(sys.stdout)

In [2]:
json_obj = """{"zoo_animal" : "Lion",
                "food" : ["Meat", "honey"],
                "fur" : "golden",
                "diet" : [{"zoo_animal" : "Gazelle", "food" : "grass", "fur" : "brown"}]}"""

In [3]:
import json

In [4]:
data = json.loads(json_obj)
data

{'zoo_animal': 'Lion',
 'food': ['Meat', 'honey'],
 'fur': 'golden',
 'diet': [{'zoo_animal': 'Gazelle', 'food': 'grass', 'fur': 'brown'}]}

In [6]:
json.dumps(data)

str

In [7]:
DataFrame(data['diet'])

  zoo_animal   food    fur
0    Gazelle  grass  brown

In [9]:
#Read from html and upload it in dataframes
url = 'http://www.fdic.gov/bank/individual/failed/banklist.html'

In [10]:
dframe_list = pd.io.html.read_html(url)
dframe = dframe_list[0]

In [11]:
dframe

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
1,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
2,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
3,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
4,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019"
...,...,...,...,...,...,...
555,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
556,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
557,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
558,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
559,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [12]:
#working with xl files
xlfile = pd.ExcelFile('Lec_28_test.xlsx')

In [14]:
df = xlfile.parse('Sheet1')
df

   This is a test  Unnamed: 1  Unnamed: 2
0              23        6678         456
1             234         678         456
2             234           7         345
3              34          56         234
4               5         456        4365